In [ ]:
#import the packages

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
#data for employees

data = {
    "Employee ID" : [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116],
    "Name" : ["Aaron", "Brad", "Bridgette", "Nicole", "Clint", "Deb", "Amber", "Drew", "Oscar", "Terry", "Trick", "Harold", "Joey", "Nico", "Pickles", "Ruby"],
    "Department" : ["Server", "Server", "Server", "Server", "Barstaff", "Barstaff", "FOH", "FOH", "FOH", "FOH", "FOH", "Kitchen", "Kitchen", "Kitchen", "Kitchen", "Kitchen"],
    "Salary" : [74000, 91000, 68000, 96000, 97000, 102000, 54000, 63000, 61000, 83000, 78000, 58000, 88000, 64000, 64000, 60000],
    "Gender" : ["Male", "Male", "Female", "Female", "Male", "Female", "Female", "Male", "Male", "Male", "Male", "Male", "Male", "Male", "Male", "Female"],
    "Yrs of Employment" : [2, 7, 3, 6, 4, 9, 3, 9, 4, 11, 1, 6, 7, 4, 4, 3]
}

In [ ]:
#create the dataframe

df = pd.DataFrame(data)
df

    Employee ID       Name Department  Salary  Gender  Yrs of Employment
0           101      Aaron     Server   74000    Male                  2
1           102       Brad     Server   91000    Male                  7
2           103  Bridgette     Server   68000  Female                  3
3           104     Nicole     Server   96000  Female                  6
4           105      Clint   Barstaff   97000    Male                  4
5           106        Deb   Barstaff  102000  Female                  9
6           107      Amber        FOH   54000  Female                  3
7           108       Drew        FOH   63000    Male                  9
8           109      Oscar        FOH   61000    Male                  4
9           110      Terry        FOH   83000    Male                 11
10          111      Trick        FOH   78000    Male                  1
11          112     Harold    Kitchen   58000    Male                  6
12          113       Joey    Kitchen   88000    Male                  7
13          114       Nico    Kitchen   64000    Male                  4
14          115    Pickles    Kitchen   64000    Male                  4
15          116       Ruby    Kitchen   60000  Female                  3